<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $permissions = [
            // الرئيسية
            'قائمة الرئيسية',


            'عرض الاعدادت',
            'تعديل الاعدادت',

            // الاذونات
            'عرض الصلاحيات',

            // الأدوار 
            'قائمة المهام',
            'تعديل المهام',
            'حذف المهام',
            
            // الاشتراكات
            'قائمة الاشتراكات',


            // الاسليدر
            'عرض الاسليدر',



            // المستويات 
            'قائمة المستويات',
            'اضافة مستوي',
            'تعديل مستوي',
            'حذف مستوي',

            // الاجزاء المضافة
            'قائمة الاجزاء المضافة',
            'اضافة الاجزاء المضافة',
            'تعديل الاجزاء المضافة',
            'حذف الاجزاء المضافة',

            // المهنج
            'قائمة المنهج',
            'اضافة مهنج',
            'تعديل المنهج',
            'حذف المنهج',


            // المستخدمين
            'قائمة المستخدمين',

            // المدراء
            'قائمة المدراء',
            'تعديل المدراء',
            'حذف المدراء',

            // المحفظون
            'قائمة المحفظون',
            'تعديل المحفظون',
            'تفاصيل المحفظون',
            'اضافة محفظ',
            'حذف محفظ',

            // الحافظون
            'قائمة الحافظون',
            'تعديل الحافظون',
            'تفاصيل الحافظون',
            'اضافة حافظ',
            'حذف حافظ',

            //  الحلقات
            'قائمة الحلقات',
            'اضافة حلقة',

            // الصفحات
            'قائمة الصفحات',
            'اضافة صفحة',

            // الفصول
            'قائمة الفصول',
            'اضافة فصل',
            'تعديل فصل',
            'حذف فصل',

            // قاعدة البيانات
            'التقرير',
            'تصدير',
            'استيراد',





        ];
        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission, 'guard_name' => 'admin']);
        }
    }
}
